# IsReset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExternalServiceUIData..::..IsReset Property
IFCExternalServiceUIData Class See Also
---
flag to indicate the value has been reset
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsReset { get; set; }
```

Visual Basic
---
```text
Public Property IsReset As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsReset {
	bool get ();
	void set (bool value);
}
```

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace